/*
* Домашнее задание к уроку 
* курса "Алгоритмы и структуры данных"
* автор Недокунев А.В.
* среда разработки Notepad++ /компилятор MinGW/
* codepage UTF-8
*/
#include <stdio.h>

int main()
{
/*Задание 1
Установить среду разработки и написать программу "Привет, мир".
*/
	printf("Hello world!\n");
	return 0;
}
